code25_all/ruby/1264087.txt

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Header>
        <RequesterCredentials xmlns:n1="urn:ebay:apis:eBLBaseComponents" xmlns="urn:ebay:api:PayPalAPI" env:mustUnderstand="0">
            <n1:Credentials>
                <Username>seller_1249669053_per_api1.synergyeoc.com</Username>
                <Password>snip</Password>
                <Subject/>
            </n1:Credentials>
        </RequesterCredentials>
    </env:Header>
    <env:Body>
        <DoCaptureReq xmlns="urn:ebay:api:PayPalAPI">
            <DoCaptureRequest xmlns:n2="urn:ebay:apis:eBLBaseComponents">
                <n2:Version>52.0</n2:Version>
                <AuthorizationID>0RF01309N5838270B</AuthorizationID>
                <Amount currencyID="USD">2600.00</Amount>
                <CompleteType>Complete</CompleteType>
                <Note/>
            </DoCaptureRequest>
        </DoCaptureReq>
    </env:Body>
</env:Envelope>

=> #<ActiveMerchant::Billing::Response:0x3e00698 @params={"payment_status"=>"None", "correlation_id"=>"a188cc8c5f94c", "timestamp"=>"2009-08-11T06:21:22Z", "pending_reason"=>"none", "build"=>"997644", "transaction_type"=>"none", "error_codes"=>"10001", "version"=>"52.0", "ack"=>"Failure", "message"=>"Internal Error", "reason_code"=>"none", "payment_type"=>"none"}, @test=true, @authorization=nil, @cvv_result={"code"=>nil, "message"=>nil}, @message="Internal Error", @success=false, @fraud_review=false, @avs_result={"code"=>nil, "postal_match"=>nil, "street_match"=>nil, "message"=>nil}>

